Revit 2024 API
BuiltInFailures.RoomFailures.RoomLevelElevs Property
 A [Room]s Upper Limit must be above its Base Level.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId RoomLevelElevs { get; }
Visual Basic
Public Shared ReadOnly Property RoomLevelElevs As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ RoomLevelElevs {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace